Repository: 84000/data-translation-memory
Catalog: toh224-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དད་པ་ཅན་རྣམས་ཀྱིས་ཇི་ལྟར་སྨིག་རྒྱུ་ལ་ཆུའི་འདུ་ཤེས་སྐྱེད་པ་དེ་ལྟ་བུར་ཆོས་རྣམས་རབ་ཏུ་ཤེས་པར་བྱའོ། །
en: “Therefore, noble son, faithful noble sons and daughters should understand all phenomena to be just like the perception of water that arises in a mirage.

source: དེ་ལྟར་ཆོས་རྣམས་རབ་ཏུ་ཤེས་པ་དེ་དག་ནི་ཡང་དག་པར་ཞུགས་པ་ཡིན་ནམ་གཞན་དུ་ཤེས་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་ཡང་དག་པར་ཞུགས་པ་མ་ཡིན་ནོ། །
en: Those who understand phenomena in this way are on the right course. Those who understand otherwise are not on the right course.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་བུད་མེད་གཅིག་གིས་མེ་ལོང་བླངས་ཏེ་བཞིན་གྱི་མཚན་མ་བརྟགས་ན་དེས་མེ་ལོང་ཤིན་ཏུ་ཕྱིས་པ་དེ་ལ་གཟུགས་བརྙན་མཛེས་ཤིང་བལྟ་ན་སྡུག་པ་མཐོང་ནས།
en: “Noble son, this may be illustrated as follows: suppose a woman takes up a mirror and examines the features of her face. In the highly polished mirror she sees a beautiful and good-looking reflection.

source: དེས་དེ་ལ་བདག་གིས་གཟུགས་བརྙན་འདི་ལ་འདོད་ཆགས་ཀྱི་སེམས་བསྐྱེད་པར་མི་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ནི་བདག་གི་མ་ཡིན་ལ་བདག་ཀྱང་འདིའི་མ་ཡིན་པའི་ཕྱིར་རོ་སྙམ་དུ་སོ་སོར་རྟོག་པར་བྱེད་ན། རིགས་ཀྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས། དེ་ལྟར་གཟུགས་བརྙན་དེ་བུད་མེད་འདི་ལ་འདོད་ཆགས་ཀྱི་སེམས་མི་སྐྱེད་པ་ངོ་མཚར་ཏོ་སྙམ་དུ་འཛིན་ཏམ།
en: While she concludes about it that she will not give rise to desirous thoughts about this reflection, the reason being that it is not hers, nor does she belong to it, do you think, noble son, it is amazing that similarly the reflection does not give rise to desirous thoughts about the woman?”

source: བཅོམ་ལྡན་འདས་གཟུགས་བརྙན་ནི་རྣམ་པར་རྟོག་པ་མ་མཆིས་པ་དང་། ཡོངས་སུ་མ་གྲུབ་པ་ལགས་ཏེ། དེ་ལ་རྟོག་པ་ཅི་ཡང་མ་མཆིས་པའི་སླད་དུའོ། །
en: Because, Blessed One, a reflection does not have thoughts, and is unreal, so it will not have any thoughts at all about her.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ཏེ།
en: The Blessed One said, “Noble son, that is so.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་གཟུགས་རྣམས་ལ་རྟོག་པར་བྱེད་དེ་གཟུགས་འདི་དག་ནི་ངན་ནོ། །འདི་དག་ནི་འབྲིང་ངོ་། །འདི་དག་ནི་རབ་བོ་སྙམ་དུ་སེམས་མོད་ཀྱི་འོན་ཀྱང་གཟུགས་རྣམས་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ལ་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་དེ་རྟོག་པར་མི་བྱེད། རྣམ་པར་རྟོག་པར་མི་བྱེད་དོ། །
en: Although childish ordinary beings formulate ideas about forms by thinking ‘these forms are bad,’ ‘these are average,’ and ‘these are excellent,’ the forms themselves do not give rise to thoughts about the nature of forms, nor do they formulate ideas or have thoughts at all.

source: སྒྲ་དང་། དྲི་དང་། རོ་དང་རེག་བྱ་རྣམས་ཀྱང་དེ་དང་འདྲའོ། །
en: It is the same for sounds, smells, tastes, and tactile objects.

source: འདི་ལྟར་ཡང་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་ནི་ཆོས་རྣམས་ལ་རྟོག་པར་བྱེད་དེ་ཆོས་འདི་དག་ནི་ངན་ནོ། །འདི་དག་ནི་འབྲིང་ངོ་། །འདི་དག་ནི་རབ་བོ་སྙམ་དུ་སེམས་མོད་ཀྱི། འོན་ཀྱང་ཆོས་རྣམས་ནི་ཆོས་ཀྱི་ངོ་བོ་ཉིད་ལ་རྣམ་པར་རྟོག་པ་མི་སྐྱེད་དེ། རྟོག་པར་མི་བྱེད། རྣམ་པར་རྟོག་པར་མི་བྱེད་དོ། །
en: “Moreover, childish ordinary beings formulate ideas about phenomena by thinking ‘these phenomena are bad,’ ‘these phenomena are average,’ and ‘these phenomena are excellent,’ yet the phenomena themselves do not give rise to thoughts about the nature of phenomena, nor do they formulate ideas or have thoughts at all.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་བུད་མེད་དེས་མེད་པ་ལ་ཡོད་པའི་འདུ་ཤེས་བསྐྱེད་ནས། དེ་ཡང་སོ་སོར་རྟོག་པར་བྱེད་ཅིང་དེ་ལ་མངོན་པར་ཞེན་པ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་འདི་དག་ནི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་ཁ་ཅིག་ཆོས་ཐམས་ཅད་གཟུགས་བརྙན་ལྟ་བུར་ཤེས་ནས་འདི་སྐད་དུ་བདག་ཅག་གཟུགས་རྣམས་ལ་ཆགས་པར་མི་བྱའོ། །
en: “Noble son, just as in the analogy that woman perceives something that does not exist as existing and clings to the conclusion she has reached about it, so too, noble son, some bhikṣus, bhikṣuṇīs, laymen, and laywomen, understanding all phenomena to be like reflections, proclaim that they are not attached to forms.

source: དེ་བཞིན་དུ་བདག་ཅག་སྒྲ་རྣམས་དང་། དྲི་རྣམས་དང་། རོ་རྣམས་དང་། རེག་བྱ་རྣམས་དང་། ཆོས་རྣམས་ལ་ཆགས་པར་མི་བྱའོ། །
en: Likewise, they proclaim that they are not attached to sounds, smells, tastes, tactile objects, or phenomena.

source: བདག་ཅག་གིས་སྡོམ་པ་བསྒྲུབ་པར་བྱའོ་ཞེས་ཟེར་ཏེ། དེ་དག་མེད་པ་དེ་ལ་ཡོད་པར་འདུ་ཤེས་བསྐྱེད་ནས་མེད་བཞིན་དུ་སོ་སོར་རྟོག་པར་བྱེད་དེ་དེ་ལ་མངོན་པར་ཞེན་ལ།
en: Stating that they have achieved restraint, they perceive those things as existing where there is nothing, conclude that they are there although they do not exist, and grasp at them.

source: དེས་ཀྱང་དགའ་བར་འཛིན་ཅིང་བདག་ལ་ནི་སྟོད་པར་བྱེད།
en: Moreover, they are pleased and praise themselves while denigrating others.

source: གཞན་ལ་ནི་བརྙས་པར་བྱེད་པ་གང་དག་ཡིན་པ་རྣམས་ཀྱང་དེ་དང་འདྲ་བར་བལྟ་བར་བྱའོ། །
en: They should be seen as just like that woman.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་མོ་ཤམ་ཞིག་ཡོད་ལ་དེ་དྲན་པ་ཉམས་པས་འདི་ལྟར་བདག་ནི་བུ་མི་འདོད་པར་བྱའོ་ཞེས་དམ་འཆའ་བར་བྱེད་པ་དེ་ལ།
en: “Noble son, this may be illustrated as follows: a barren woman whose presence of mind was impaired vowed not to hope for a son.

source: བུད་མེད་ལ་ལ་ཞིག་གིས་ཡིད་བསྲུང་བའི་ཕྱིར་ཤེས་ཤིང་རྟོགས་བཞིན་དུ་འདི་སྐད་ཅེས། ཁྱོད་ཀྱི་བུ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཞིག་ཡོད་པར་འགྱུར་གྱིས། འདི་ལྟར་དམ་མི་བཅའ་བར་གསོལ་ཞེས་ཟེར་ལ།
en: Another woman, while knowing and understanding her situation, to console her said, ‘You will have a boy with a fine figure, who is handsome and good looking, so I beg you not to make such a vow.’

source: དེ་ནས་མོ་ཤམ་དེས་བུད་མེད་དེའི་ཚིག་མཉན་ནས་དྲན་པ་ཉམས་པས་བདག་གི་བུ་གཟུགས་བཟང་ཞིང་མཛེས་ལ་བལྟ་ན་སྡུག་པ་ཞིག་ཡོད་པར་འགྱུར་རོ་སྙམ་དུ་རེ་བའི་སེམས་སྐྱེད་པར་བྱེད་དེ།
en: The barren woman took heed of her words, and her presence of mind being impaired gave rise in her thoughts to the hope for a son, thinking, ‘I will have a boy with a fine figure, who is handsome and good looking.’

source: སེམས་འཁྲུལ་པ་དེས་འདུ་ཤེས་ཀྱི་རྣམ་པ་དེས་སེམས་ཡོངས་སུ་མགུ་བར་བྱེད་ལ།
en: Due to her confusion, the mental image of his appearance exhilarated her.

source: བུ་ནི་སྐྱེས་ཀྱང་མ་སྐྱེས་སྐྱེ་བར་ཡང་མི་འགྱུར་བ་དེ་བཞིན་དུ་རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པ་ནི་ཆོས་ཐམས་ཅད། མོ་ཤམ་གྱི་བུ་དང་འདྲ་བར་མཁྱེན་ཅིང་གཟིགས་བཞིན་དུ་འཇིག་རྟེན་གྱི་རྗེས་སུ་འཐུན་པར་བྱ་བའི་ཕྱིར་གཉིས་སུ་སྟོན་ཏེ། འདས་པའི་དུས་ན་ཁྱོད་མིང་འདི་ཞེས་བྱ་བར་གྱུར། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། ཁ་དོག་ནི་འདི་འདྲ་བར་གྱུར། ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་ཟ། ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་གནས་གནས།
en: “Just as it could not happen that such a boy would either have been born nor not have been born, so too, noble son, the Tathāgata, while knowing and seeing all phenomena to be like the son of a barren woman, to conform with the world teaches dualistically in saying, ‘In the past you were named so-and-so, your family was called such-and-such, your clan was called such-and-such, your complexion was like this, you ate such-and-such food, lived for such-and-such a duration, experienced such-and-such happiness and suffering, and had such-and-such a lifespan.

source: བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་ཉམས་སུ་མྱོང་། ཚེའི་མཐའ་ནི་འདི་སྲིད་ཅིག་ཏུ་གྱུར་ཏོ། །མ་འོངས་པའི་དུས་ན་ནི་འདི་ལྟ་བུ་ཞིག་ཏུ་འགྱུར་ཏེ། མིང་ནི་འདི་སྐད་ཅེས་བྱ་བར་འགྱུར། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། ཁ་དོག་ནི་འདི་འདྲ་བར་འགྱུར།
en: In the future you will be like such-and-such: named so-and-so, your family called such-and-such, your clan called such-and-such, your complexion like this, you will eat such-and-such food, you will live for such-and-such a duration, you will experience such-and-such happiness and suffering, and you will have such-and-such a lifespan.

source: ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ་བར་འགྱུར། ཡུན་ནི་འདི་སྲིད་ཅིག་ཏུ་གནས་པར་འགྱུར། བདེ་བ་དང་སྡུག་བསྔལ་ནི་འདི་ལྟ་བུ་ཞིག་ཉམས་སུ་མྱོང་བར་འགྱུར། ཚེའི་མཐའ་ནི་འདི་སྲིད་ཅིག་ཏུ་འགྱུར་རོ། །དེ་བཞིན་དུ་ད་ལྟར་བྱུང་བའི་དུས་ན་མིང་ནི་འདི་ཞེས་བྱ། རིགས་ནི་འདི་ཞེས་བྱ། རུས་ནི་འདི་ཞེས་བྱ། ཁ་དོག་ནི་འདི་འདྲ་བ་ཞིག །ཟས་ནི་འདི་ལྟ་བུ་ཞིག་ཟ། ཡུན་ནི་འདི་སྲིད་ཅིག་གནས། བདེ་བ་དང་སྡུག་བསྔལ་བ་ནི་འདི་ལྟ་བུ་ཞིག་ཉམས་སུ་མྱོང་།
en: Likewise, in the present, you are named so-and-so, your family is called such-and-such, your clan is called such-and-such, your complexion is like this, you eat such-and-such food, you live for such-and-such a duration, you experience such-and-such happiness and suffering, and you are able to have such-and-such a lifespan.’

source: ཚེའི་མཐའ་ནི་འདི་སྲིད་ཅིག་ཐུབ་པོ་ཞེས་སྟོན་པར་མཛད་དོ། །རིགས་ཀྱི་བུ་དཔེར་ན་མོ་ཤམ་དེ་རང་གི་བརྟགས་པས་བུའི་འདུ་ཤེས་དེས་རེ་བར་བྱེད་ལ་བུ་དེ་ནི་མི་སྐྱེ་བའི་ཆོས་ཅན་ནོ། །
en: “In the analogy, noble son, through the barren woman’s own imagination, her idea of a son made her hopeful, but that son had the quality of being nonarising.

source: མི་སྐྱེ་བའི་ཆོས་ཅན་ཡིན་པས་ན་མི་འགག་པའི་ཆོས་ཅན་ནོ། །
en: As he had the quality of being nonarising, he had the quality of being nonceasing.

source: མི་འགག་པའི་ཆོས་ཅན་ཡིན་པས་ན་རྣམ་པར་རིག་བྱེད་མ་ཡིན་པའི་ཆོས་ཅན་ནོ། །
en: As he had the quality of being nonceasing, he had the quality of being nondiscernible.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་གཟུགས་ཐམས་ཅད་ནི་གཟུགས་ཀྱི་ངོ་བོ་ཉིད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ཅན་ནོ། །
en: “Likewise, noble son, all forms, because of the nature of form, have the quality of being nonarising.

source: མི་འགག་པའི་ཆོས་ཅན་ཡིན་པས་ན་རྣམ་པར་རིག་བྱེད་མ་ཡིན་པའི་ཆོན་ཅན་ནོ། །
en: Since they have the quality of being unceasing, they have the quality of being nondiscernible.

source: ཚོར་བ་ཐམས་ཅད་དང་། འདུ་ཤེས་ཐམས་ཅད་དང་། འདུ་བྱེད་ཐམས་ཅད་དང་། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ཀྱང་དེ་དང་འདྲ་སྟེ། རྣམ་པར་ཤེས་པའི་ངོ་བོ་ཉིད་ཀྱིས་མི་སྐྱེ་བའི་ཆོས་ཅན་ནོ། །
en: “All feelings, all perceptions, all karmic formations, and all consciousnesses are also like that: consciousnesses, because of the nature of consciousness, have the quality of being unborn.

source: མི་འགག་པའི་ཆོས་ཅན་ཡིན་པས་ན་རྣམ་པར་རིག་བྱེད་མ་ཡིན་པའི་ཆོས་ཅན་ཏེ།
en: Since they have the quality of being unceasing, they have the quality of being nondiscernible.

source: ཆོས་ཀྱི་ངོ་བོ་ཉིད་དེ་ལྟར་མི་ཤེས་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་ཡང་དག་པར་ཞུགས་པ་མ་ཡིན་ནོ། །
en: Those who do not understand the nature of phenomena in that way are not on the right course.

source: ཆོས་རྣམས་དེ་ལྟར་ཤེས་པ་གང་དག་ཡིན་པ་དེ་དག་ནི་ཡང་དག་པར་ཞུགས་པ་ཡིན་ཏེ། དེ་དག་ནི་ལམ་ལ་གནས་པ་ཡིན་ནོ། །
en: “Those who do understand phenomena in this way are on the right course; they stay on the path.

source: དེ་དག་ནི་ལམ་ལས་མི་གཡོ་བ་ཡིན་ནོ། །
en: They do not move away from the path.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་གནས་པ་ནི་ཆོས་ཀྱི་དབྱིངས་མི་གཡོ་བའི་ཚུལ་གྱིས་མི་གཡོ་བ་ཡིན་པའི་ཕྱིར་རོ། །རིགས་ཀྱི་བུ་དེ་ལྟ་བས་ན། རིགས་ཀྱི་བུའམ།
en: Because to stay in the tathāgatas’ Dharma is to not move away, in the manner that the dharmadhātu does not move away.

source: རིགས་ཀྱི་བུ་མོ་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་ལ་འཇུག་པར་འདོད་པས་འདོད་ཆགས་ལས་གཡོ་བར་མི་བྱའོ། །ཞེ་སྡང་ལས་གཡོ་བར་མི་བྱའོ། །གཏི་མུག་ལས་གཡོ་བར་མི་བྱའོ། །ཉོན་མོངས་པ་ཐམས་ཅད་ལས་གཡོ་བར་མི་བྱའོ། །མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ལས་གཡོ་བར་མི་བྱའོ། །
en: Therefore, noble son, if noble sons and noble daughters wish to practice the way of the tathāgatas’ Dharma, they should not move away from desire, should not move away from hatred, should not move away from ignorance, should not move away from all afflictions, and should not move away from the eye, forms, or eye consciousness.

source: དེ་བཞིན་དུ་རྣ་བ་དང་། སྒྲ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣ་དང་། དྲི་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེ་དང་། རོ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་དང་། རེག་བྱ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་དང་།
en: Likewise, they should not move away from the ear, sounds, or ear consciousness; from the nose, smells, or nose consciousness; from the tongue, tastes, or tongue consciousness; from the body, tactile objects, or body consciousness; or from the mind, phenomena, or mental consciousness.

source: ཆོས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལས་གཡོ་བར་མི་བྱའོ། །ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ལས་གཡོ་བར་མི་བྱའོ། །
en: They should not move away from the perception of all phenomena.

source: ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ལ་ཡང་གནས་པར་མི་བྱའོ། །
en: They should also not stay in the perception of all phenomena.

source: གལ་ཏེ་འདོད་ཆགས་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from desire they would move away from the dharmadhātu.

source: སྟོང་པ་ཉིད་མི་གཡོ་བའི་དོན་གྱིས་འདོད་ཆགས་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Its real identity being unmoving emptiness, desire is itself the dharmadhātu.

source: གལ་ཏེ་ཞེ་སྡང་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from hatred, they would move away from the dharmadhātu.

source: མཚན་མ་མེད་པ་མི་གཡོ་བའི་དོན་གྱིས་ཞེ་སྡང་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Its real identity being unmoving signlessness, hatred is itself the dharmadhātu.

source: གལ་ཏེ་གཏི་མུག་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from ignorance, they would move away from the dharmadhātu.

source: སྨོན་པ་མེད་པ་མི་གཡོ་བའི་དོན་གྱིས་གཏི་མུག་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Its real identity being unmoving wishlessness, ignorance is itself the dharmadhātu.

source: གལ་ཏེ་ཉོན་མོངས་པ་ཐམས་ཅད་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from all afflictions, they would move away from the dharmadhātu.

source: ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་ངོ་བོ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་མི་གཡོ་བའི་དོན་གྱིས་ཉོན་མོངས་པ་ཐམས་ཅད་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Their real identity being the unmoving nature of all afflictions realized just as it is, all afflictions are themselves the dharmadhātu.

source: གལ་ཏེ་མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from the eye, forms, and eye consciousness, they would move away from the dharmadhātu.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་གཡོ་བའི་དོན་གྱིས་མིག་དང་། གཟུགས་དང་། མིག་གི་རྣམ་པར་ཤེས་པ་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Their real identity being unmoving dependent origination, the eye, forms, and eye consciousnesses are themselves the dharmadhātu.

source: དེ་བཞིན་དུ་གལ་ཏེ་རྣ་བ་དང་། སྒྲ་དང་། རྣ་བའི་རྣམ་པར་ཤེས་པ་དང་། སྣ་དང་། དྲི་དང་། སྣའི་རྣམ་པར་ཤེས་པ་དང་། ལྕེ་དང་། རོ་དང་། ལྕེའི་རྣམ་པར་ཤེས་པ་དང་། ལུས་དང་། རེག་བྱ་དང་། ལུས་ཀྱི་རྣམ་པར་ཤེས་པ་དང་། ཡིད་དང་། ཆོས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལས་གཡོ་བར་གྱུར་ན། ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “Likewise, if they were to move away from the ear, sounds, and ear consciousness; from the nose, smells, and nose consciousness; from the tongue, tastes, and tongue consciousness; from the body, tactile objects, and body consciousness; or from the mind, phenomena, and mental consciousness, they would move away from the dharmadhātu.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་གཡོ་བའི་དོན་གྱིས། ཡིད་དང་། ཆོས་དང་། ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Their real identity being unmoving dependent origination, the mind, phenomena, and mental consciousness are themselves the dharmadhātu.

source: གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ལས་གཡོ་བར་གྱུར་ན་ཆོས་ཀྱི་དབྱིངས་ལས་གཡོ་བར་འགྱུར་རོ། །
en: “If they were to move away from the perception of all phenomena they would move away from the dharmadhātu.

source: ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཀྱི་ངོ་བོ་ཉིད་ཇི་ལྟ་བ་བཞིན་དུ་རྟོགས་པ་མི་གཡོ་བའི་དོན་གྱིས་ཆོས་ཐམས་ཅད་ཀྱི་འདུ་ཤེས་ཉིད་ཆོས་ཀྱི་དབྱིངས་ཡིན་པའི་ཕྱིར་རོ། །
en: Its real identity being the unmoving nature of the perception of all phenomena realized just as it is, the perception of all phenomena is itself the dharmadhātu.

source: ངས་དེ་ལས་དགོངས་ནས་ཚིག་འདི་སྐད་དུ་ལོག་པར་ལྟ་བ། ལོག་པར་ལྟ་བ་ཡིན་པར་མཐོང་ན། དེ་དེའི་ཡང་དག་པར་ལྟ་བ་ཡིན་ནོ་ཞེས་གསུངས་སོ། །
en: “It was with this in mind that I have said that when a wrong view is seen to be a wrong view, that is the right view of it.

source: བསལ་བ་མེད་པ་དང་། གཞག་པ་མེད་པའི་ཚུལ་གྱིས་ལོག་པར་ལྟ་བ་ལས་ཀྱང་མི་གཡོ་ལ། ལོག་པར་ལྟ་བ་མེད་པར་གྱུར་པ་ལས་གུད་ན་ཡང་། ཡང་དག་པར་ལྟ་བ་མེད་དེ། ཆོས་ཐམས་ཅད་གཉིས་སུ་མེད་པའི་ཕྱིར།
en: The right view not only does not move away from wrong views, by way of neither negating them nor affirming them, but also has no existence apart from wrong views being absent, because all phenomena are nondual.

source: ལོག་པར་ལྟ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་ཉིད་ཡང་དག་པར་ལྟ་བ་ཡིན་གྱི་གཉིས་སུ་འདུ་ཤེས་པ་ལ་ནི་ཡང་དག་པར་ལྟ་བ་མེད་དོ། །
en: Seeing wrong views rightly, just as they are, is the right view, but in dualistic discrimination there is no right view.

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན་མི་ལ་ལ་ཞིག་ནུབ་མོ་མུན་པ་མུན་ནག་གི་ནང་ན་ལམ་དུ་ཞུགས་ཏེ།
en: “Noble son, this may be illustrated as follows: suppose a man were on a road at night, shrouded in darkness.

source: དེས་འབྲོག་ཁོང་སྟོང་ཞིག་ཏུ་ཤིང་ལྗོན་པ་ཕལ་པོ་ཆེ་སྟུག་པོ་མཐོང་ལ།
en: In the empty wilderness he sees a thicket of trees, and there next to one of the trees he thinks he perceives a bandit.

source: དེས་དེར་ཤིང་ཞིག་གི་དྲུང་ན་ཆོམ་རྐུན་ཡོད་པའི་འདུ་ཤེས་བསྐྱེད་ནས་སྐྲག་སྟེ་ལམ་དེར་མ་སོང་ན།
en: He becomes frightened and does not proceed on the path.

source: ཅི་མི་དེ་སྣང་བ་ཡང་མ་བྱུང་། ཤིང་དེ་ཡང་མངོན་སུམ་དུ་མ་བྱས་པར་ཤིང་སྟུག་པོ་དེ་ལས་འཕགས་པའམ། ཆོམ་རྐུན་གྱི་འཇིགས་པ་མེད་པར་འགྱུར་རམ།
en: Without it getting light and the trees becoming visible, would that man have passed beyond the thicket of trees, and would he have been free of fearing there was a bandit?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: The Blessed One continued, “Noble son, what do you think?

source: ཅི་མི་དེ་སྣང་བ་ཡང་ཡོད་ལ་ཤིང་ཡང་མངོན་སུམ་དུ་བྱས་ན་ཤིང་སྟུག་པོ་དེ་ལས་འཕགས་པའམ། ཆོམ་རྐུན་གྱི་འཇིགས་པ་མེད་པར་འགྱུར་རམ།
en: If it had got light and the trees had become visible, would he have passed beyond the thicket of trees, and would he have been free of fearing there was a bandit?”

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ། །
en: “Yes, Blessed One,” he replied.

source: བཅོམ་ལྡན་འདས་འདི་ལྟར་མི་དེས་འཇིགས་པ་མ་མཆིས་པ་ལ་འཇིགས་པའི་འདུ་ཤེས་བསྐྱེད་ཅིང་། ཡང་དག་པ་མ་ལགས་པ་ཀུན་བརྟགས་པའི་སླད་དུའོ། །
en: Because, Blessed One, where there was no danger the man thought he perceived danger, and imagined something that was untrue.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྩོད་པས་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིན་ཅི་ལོག་གིས་ཕྱིན་ཅི་ལོག་ཏུ་གྱུར་པ།
en: The Blessed One said, “Likewise, noble son, childish ordinary beings, due to their disputes, go wrong by making mistakes about what is untrue.

source: མ་རིག་པའི་མུན་པས་མིག་ཀུན་ནས་གཡོགས་པ་ཐམས་ཅད་མེད་བཞིན་དུ་སྒྲོ་བཏགས་པས་འཁོར་བའི་འཇིགས་པས་སྐྲག་ནས་འཁོར་བ་ལས་ངེས་པར་འབྱུང་བ་ཡོངས་སུ་ཚོལ་ལོ། །
en: All those whose vision is enveloped in the darkness of ignorance seek escape from saṃsāra because they are frightened by dangers of saṃsāra that do not exist but that they have superimposed.

source: དེ་དག་གིས་གང་དུ་འཇིགས་པའི་འདུ་ཤེས་བསྐྱེད་པའི་འཁོར་བ་དེ་ཡང་དོན་དམ་པར་མི་དམིགས་ན་དེ་དག་མྱ་ངན་ལས་འདས་པ་ནི་འཇིགས་པ་མེད་པའོ་ཞེས་ཡོངས་སུ་ཚོལ་བར་བྱེད་དོ། །
en: In that saṃsāra within which they think they perceive dangers and that is not ultimately to be apprehended, they seek what they say is a nirvāṇa that is free of dangers.

source: དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ནི་འཁོར་བ་དེ་ཉིད་མྱ་ངན་ལས་འདས་པ་ཡིན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ལ།
en: “Those who are mentored by a spiritual friend and are on the right course know fully just as it is that saṃsāra itself is nirvāṇa.

source: ཆོས་ཐམས་ཅད་ཀྱི་སྐྱེ་བ་མེད་པ་ཡང་རབ་ཏུ་ཤེས་ཏེ།
en: They also know fully that all phenomena are nonarising.

source: དེ་ལྟར་ཡང་དག་པར་ཞུགས་པ་དེ་དག་ནི་ཆོས་གང་ཡང་ལེན་པར་མི་བྱེད། འདོར་བར་མི་བྱེད། སེལ་བར་མི་བྱེད། འཇོག་པར་མི་བྱེད་དོ། །
en: Those who are thus on the right course do not take up any phenomena at all, nor do they discard them, negate them, or affirm them.

source: ཆོས་ཀྱི་དབྱིངས་ལ་གནས་ཏེ་གཡོ་བ་མེད་དོ། །
en: As they stay in the dharmadhātu, they do not move away.

source: མི་གཡོ་བས་ན་གནས་སྒོམ་པར་མི་བྱེད།
en: As they do not move away, they do not cultivate staying.

source: མི་སྒོམ་པས་ན་གནས་མེད་དོ། །
en: As they do not cultivate it, they are without staying.

source: གནས་མེད་པས་ན་གཡོ་བ་མེད་དེ།
en: As they are without staying, they are without moving away.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་གཡོ་བ་མེད་པ་སྟེ།
en: This is the way of the tathāgatas’ Dharma that is without moving away.

source: དེ་ལ་ནི་གཡོ་བར་བྱ་བའམ་འཕགས་པར་བྱ་བའམ། དོར་བར་བྱ་བའམ་བླང་བར་བྱ་བའི་ཆོས་ཅི་ཡང་མི་དམིགས་སོ། །
en: In it no phenomena are apprehended to move away from, to pass beyond, to discard, or to take up.

source: ཆོས་ཀྱི་ཚུལ་ནི་ནམ་མཁའི་ཚུལ་ཉིད་ཡིན་ལ། ནམ་མཁའ་ལ་ནི་གཡོ་བ་ཡང་མེད། འཕགས་པ་ཡང་མེད་པའི་ཕྱིར་རོ། །
en: The way of the Dharma is the way of space: space is without moving away and without surpassing.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཡང་དག་པར་ཞུགས་པ་ཤེས་པ་དང་ལྡན་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ཀྱང་ཤེས་པའི་ཡོངས་སུ་ཤེས་པ་དེ་ལས་བསྐྱོད་ཅིང་བསྒུལ་བར་མི་ནུས་སོ། །
en: “Noble son, those who know how to stay on the right course in this way cannot be shifted or shaken from realizing that knowledge, even by all sentient beings.

source: འདི་ལྟར་དེས་མི་གཡོ་བའི་ཡེ་ཤེས་ཐོབ་པའི་ཕྱིར་རོ། །
en: Because in this way they have attained nonmoving wisdom.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: The venerable Śāriputra then got up from his seat, draped his upper robe over one shoulder, and knelt with his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་ཤེས་རབ་དང་ལྡན་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: His palms joined, he bowed toward the Blessed One and said, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among the wise.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་མི་ཤེས་པ་ཐམས་ཅད་སེལ་བ་དང་། ཤེས་པ་ཐམས་ཅད་དང་ལྡན་པའི་སླད་དུའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Blessed One, it is because this presentation of Dharma clears away all ignorance and contains all knowledge.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་བར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི། རྫུ་འཕྲུལ་དང་ལྡན་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Mahāmaudgalyāyana said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those with magical power.

source: བཅོམ་ལྡན་འདས་མིག་གི་རྣམ་པར་ཤེས་པར་བགྱི་བ་གང་ལགས་པ་དེ་ནི་རྫུ་འཕྲུལ་མ་ལགས་ཀྱི།
en: Blessed One, it is not a magical power to cause someone to see something.

source: བཅོམ་ལྡན་འདས་གང་མིག་གི་རྣམ་པར་ཤེས་པར་བགྱི་བའི་ཆོས་ཐམས་ཅད་ལ་སེ་གོལ་གཏོགས་པ་ཙམ་ཡང་མོས་པར་མི་བགྱིད་པ་དེ་ནི་རྫུ་འཕྲུལ་གྱི་མཆོག་ལགས་པའི་སླད་དུའོ། །
en: The supreme magical power, Blessed One, is not to be convinced—even for the duration of a mere snap of the fingers—by all phenomena causing one to see something.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ནམ་གྲུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པའམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་བསམ་གཏན་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Revata said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those with concentration.

source: བཅོམ་ལྡན་འདས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ནི་ཉོན་མོངས་པ་ཐམས་ཅད་ངེས་པར་སྲེག་པ་ལགས་པའི་སླད་དུའོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Because, Blessed One, this presentation of Dharma truly burns up all afflictions.”

source: བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པའམ། ཀུན་ཆུབ་པར་བགྱིད་པ་འམ། མོས་པར་བགྱིད་པ་དེ་དག་ནི་ཉོན་མོངས་པ་མ་མཆིས་པར་གནས་པའི་མཆོག་ཏུ་བསྟན་པར་བགྱི་བ་ལགས་སོ། །
en: Then, the venerable Subhūti said to the Blessed One, “Blessed One, I proclaim that the noble sons and noble daughters who take up this presentation of Dharma, master it, or have faith in it are supreme among those who abide without afflictions.
